
#include "init.h"

//**************************************************************************
//**************************************************************************

//Инициализация GPIO...
void init_GPIO(void){

	RCC->AHBENR |= RCC_AHBENR_GPIOAEN;	//Включаем тактирование GPIOA
	GPIOA->MODER &= ~(1<<1|1<<0);  		//PA0 на вход, USER_BTN

	//NVIC->ISER[0] |= 1<<6; //Разрешение прерывания EXTI0
	//SYSCFG->EXTICR[0] |= SYSCFG_EXTICR1_EXTI0_PA; //Линия PA0
	//EXTI->IMR |= EXTI_IMR_MR0; //Разрешение прерывания PA0
	//EXTI->RTSR |= EXTI_RTSR_TR0; //Прерывание по фронту

	RCC->AHBENR |= RCC_AHBENR_GPIOEEN;	//Включаем тактирование GPIOE
	GPIOE->MODER |= (0<<31|1<<30); 		//Green LED, на выход

	GPIOE->MODER |= (0<<17|1<<16); 	//Blue LED, PE8 на выход
	//GPIOE_MODER |= (0<<19|1<<18); 	//Red LED, PE9 на выход
	//GPIOE_MODER |= (0<<21|1<<20); 	//Orange LED, на выход

}

//**************************************************************************
//**************************************************************************



