
#include "main.h"

int main(void){

asm volatile ("CPSID I"); //Глобальное запрещение прерываний

	init_GPIO();		//Инициализация GPIO
	USART1_Init();		//Инициализация USART1
	RCC_init();			//Инициализация ФАПЧ
	//ADC1_Init();		//Инициализация ADC1

	L3GD20_init(); 		//Инициализация L3GD20
	//nRF_Init();			//Инициализация nRF

asm volatile ("CPSIE I"); //Глобальное разрешение прерываний

//*******************************************************************************

	USART1_Send_String((u8*)"STM32F3 Discovery started!...\n\n");

	__USART1_Protocol_Init();	//Инициализация обработчика протокола USART1
	__nRF_Protocol_Init();		//Инициализация обработчика протокола nRF

//*******************************************************************************



//*******************************************************************************
//*******************************************************************************

//Начало основного цикла...
	while(1){

		//__USART1_Protocol_Handler();	//Обработчик протокола USART1
		//__nRF_Protocol_Handler();		//Обработчик протокола nRF


		_STATUS_REG.reg = L3GD20_Exchange_Word(READ, STATUS_REG, NULL);

		USART1_Send_String((u8*)"STATUS_REG........");
		USART1_Print_Byte(_STATUS_REG.reg, BIN);
		USART1_Send_Byte('\n');

		if(_STATUS_REG.bit.ZYXOR)
			USART1_Send_String((u8*)"X, Y or Z -axis data overrun!...\n");



		SYSTEM_BLNK;

	}//Конец основного цикла

}//Конец основной функции

//*******************************************************************************
//*******************************************************************************
