
#include "main.h"

int main(void){

asm volatile ("CPSID I"); //Глобальное запрещение прерываний

	init_GPIO();		//Инициализация GPIO
	USART1_Init();		//Инициализация USART1
	RCC_init();			//Инициализация ФАПЧ
	//ADC1_Init();		//Инициализация ADC1

	L3GD20_init(); 		//Инициализация L3GD20
	//nRF_Init();		//Инициализация nRF

asm volatile ("CPSIE I"); //Глобальное разрешение прерываний

//*******************************************************************************

	USART1_Send_String((u8*)"\nSTM32F3 Discovery started!...\n\n");

	__USART1_Protocol_Init();	//Инициализация обработчика протокола USART1
	__nRF_Protocol_Init();		//Инициализация обработчика протокола nRF

//*******************************************************************************

	NVIC_SetPriority(TIM2_IRQn, 1); //Приоритет прерывания
	NVIC_EnableIRQ(TIM2_IRQn); //Разрешаем обработку прерывания от таймера 2

	RCC->APB1ENR = RCC_APB1ENR_TIM2EN;

	TIM2->PSC = 16799;//Настройка предделителя таймера
	TIM2->ARR = 5000;//Загружаем число миллисекунд в регистр автоперезагрузки
	TIM2->DIER |= TIM_DIER_UIE; //Разрешаем прерывание при переполнении счетчика
	TIM2->CR1 |= TIM_CR1_CEN;//Запускаем счет


//*******************************************************************************
//*******************************************************************************

//Начало основного цикла...
	while(1){

		//__USART1_Protocol_Handler();	//Обработчик протокола USART1
		//__nRF_Protocol_Handler();		//Обработчик протокола nRF


		SYSTEM_BLNK;

	}//Конец основного цикла

}//Конец основной функции

//*******************************************************************************
//*******************************************************************************

void TIM2_IRQHandler(void) //Функция обработчика прерывания от таймера 6
  {
    TIM2->SR &= ~TIM_SR_UIF; //Сбрасываем бит вызова прерывания.
    GPIOE->ODR ^= (1<<8); //Инвертируем состояние вывода - зажигаем/гасим светодиод
  }
