
#include "main.h"

int main(void){

asm volatile ("CPSID I"); //Глобальное запрещение прерываний

	init_GPIO();		//Инициализация GPIO
	USART1_Init();		//Инициализация USART1
	//ADC1_Init();		//Инициализация ADC1

	L3GD20_init(); 		//Инициализация L3GD20

	nRF_Init();			//Инициализация nRF

asm volatile ("CPSIE I"); //Глобальное разрешение прерываний

//*******************************************************************************

	USART1_Send_String((u8*)"STM32F3 Discovery started!...\n\n");

	__USART1_Protocol_Init();	//Инициализация обработчика протокола USART1
	__nRF_Protocol_Init();		//Обработчик протокола nRFботчика протокола

//*******************************************************************************

//*******************************************************************************
//*******************************************************************************

//Начало основного цикла...
	while(1){

		__USART1_Protocol_Handler();	//Обработчик протокола USART1
		__nRF_Protocol_Handler();		//Обработчик протокола nRF


		SYSTEM_BLNK;

	}//Конец основного цикла

}//Конец основной функции

//*******************************************************************************
//*******************************************************************************
