
#include "stm32_stdlib.h"

//**************************************************************************

//Задержка...
void _delay(u32 index){ /* 104 - 15мкс; 1200 - 150мкс; 16000 - 2мс */

	while(index--);
}

//**************************************************************************

//Возвращает длинну строки...
u8 _strlen (uc8 *str) {

	return (*str) ? _strlen(++str) + 1 : 0;
}

//**************************************************************************

//Сравниваем две строки...
enum boolean _strcmp(u8 *str1, u8 *str2){

	u8 str1_len = _strlen(str1); //Вычисляем длинну первой строки
	u8 str2_len = _strlen(str2); //Вычисляем длинну второй строки

    if(str1_len != str2_len) return FALSE; //Длинна строк не совпадает, строки не равны

    //Символы в i-той позиции строк не совпадают, строки не равны
    for (u8 i = 0; i <= str1_len; i++) if (*str1++ != *str2++) return FALSE;

    return TRUE; //Строки равны
}

//**************************************************************************
//**************************************************************************
